Documents/Списание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Списание</Name>
			<BasedOn>
				<xr:Item>Document.Производство</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>InformationRegister.СведенияОИсследованиях</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтбиравшийПробу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныОтбораПроб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТНПА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаслоТехническое</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДляСлужебной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияТранспортировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТранспортировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбИдентификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформацияОбИдентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпускПродукции</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Производство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходНаИспытания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потери</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращеноВТЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМасла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладВозвратаМасла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пробы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПроб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРозлива</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВеличинаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесПробы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦельИсследования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦелиИсследований</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТНПАНаОтборПроб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТНПА1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТНПА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СведенияОИсследованиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СведенияОИсследованиях</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Органолептика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганолептикаСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Списание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Арбитраж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АрбитражСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Списание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколИспытаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколИспытанийСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПротоколИспытаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтсатусИспытаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусИспытаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВыпускПродукции</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Производство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НормыСписанияПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НормыСписанияПродукции</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоСписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НижнийПредел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерхнийПредел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиИсследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Списание/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПроведения(Отказ, Режим)
		ПоследняяНоменклатура = "" ;
		// регистр Остатки Расход
		Движения.Остатки.Записывать = Истина;
		Для Каждого ТекСтрокаПробы Из Пробы Цикл
			Если ТекСтрокаПробы.ДатаРозлива = Дата(1, 1, 1) Тогда
				ДатаПартии = ТекСтрокаПробы.ДатаИзготовления;
			Иначе 
				ДатаПартии = ТекСтрокаПробы.ДатаРозлива;
			КонецЕсли;  
			РеальныйОстаток = ВозвратОстатковВызовСервера.ОстаткиНоменклатуры(Дата, Склад, ТекСтрокаПробы.НаименованиеПроб);
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаПробы.НаименованиеПроб;
			Движение.Склад = Склад;
			Движение.НомерПартии = ТекСтрокаПробы.НомерПартии;
			Движение.Количество = ТекСтрокаПробы.ВесПробы;
			Движение.ДатаВыпуска = ДатаПартии;
			Если ТекСтрокаПробы.ЦельИсследования = Справочники.ЦелиИсследований.Арбитраж Тогда
				Движение = Движения.Остатки.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаПробы.НаименованиеПроб;
				ПоследняяНоменклатура = ТекСтрокаПробы.НаименованиеПроб;
				Движение.Склад = Справочники.Склад.Арбитраж;
				Движение.НомерПартии = ТекСтрокаПробы.НомерПартии;
				Движение.Количество = ТекСтрокаПробы.ВесПробы;
				Движение.ДатаВыпуска = ДатаПартии;
			КонецЕсли;
			
			// регистр СведенияОИсследованиях
			Если ТекСтрокаПробы.ЦельИсследования = Справочники.ЦелиИсследований.Арбитраж Тогда
				Набор = РегистрыСведений.СведенияОИсследованиях.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ВыпускПродукции);
				Набор.Прочитать();
				Для Каждого Запись Из Набор Цикл 
					Запись.Арбитраж = Истина;
					Запись.АрбитражСсылка = Ссылка;
					Запись.СтсатусИспытаний = ОбщегоНазначенияСервер.ОпредлениеСтатусаИсследований(Запись.Арбитраж, Запись.Органолептика, Запись.ПротоколИспытаний);
					Если Набор.Модифицированность() Тогда
						Набор.Записать();
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли СтрНайти(ТекСтрокаПробы.ЦельИсследования.Наименование, "Органолептические показатели") <> 0 Тогда
				Набор = РегистрыСведений.СведенияОИсследованиях.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(ВыпускПродукции);
				Набор.Прочитать();
				Для Каждого Запись Из Набор Цикл 
					Запись.Органолептика = Истина;
					Запись.ОрганолептикаСсылка = Ссылка;
					Запись.СтсатусИспытаний = ОбщегоНазначенияСервер.ОпредлениеСтатусаИсследований(Запись.Арбитраж, Запись.Органолептика, Запись.ПротоколИспытаний);
					Если Набор.Модифицированность() Тогда
						Набор.Записать();
					КонецЕсли;
				КонецЦикла;
			КонецЕсли
		КонецЦикла;
		
		//Движение остатков масла
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВидМасла;
		Движение.Склад = СкладВозвратаМасла;
		Движение.Количество = Окр(ВозвращеноВТЦ/100*ОбщегоНазначенияСервер.ОпределитьПроцентВозврата(ПоследняяНоменклатура), 2);
	
	КонецПроцедуры
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Производство") Тогда
			Дата = ДанныеЗаполнения.Дата+60;
			Склад = ДанныеЗаполнения.СкладПоступленияПродукции;
			ВыпускПродукции = ДанныеЗаполнения.Ссылка;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НормыСписанияПродукцииСрезПоследних.Продукция КАК Продукция,
			|	НормыСписанияПродукцииСрезПоследних.НижнийПредел КАК НижнийПредел,
			|	НормыСписанияПродукцииСрезПоследних.ВерхнийПредел КАК ВерхнийПредел,
			|	НормыСписанияПродукцииСрезПоследних.ПричинаСписания КАК ПричинаСписания,
			|	НормыСписанияПродукцииСрезПоследних.КоличествоСписания КАК КоличествоСписания
			|ИЗ
			|	РегистрСведений.НормыСписанияПродукции.СрезПоследних(&ДатаСпсиания, ) КАК НормыСписанияПродукцииСрезПоследних
			|ГДЕ
			|	НормыСписанияПродукцииСрезПоследних.Продукция = &Продукция
			|	И НормыСписанияПродукцииСрезПоследних.НижнийПредел <= &ВеличинаПартии
			|	И НормыСписанияПродукцииСрезПоследних.ВерхнийПредел >= &ВеличинаПартии";
			
			Запрос.УстановитьПараметр("ДатаСпсиания", Дата);
			Запрос.УстановитьПараметр("Продукция", ДанныеЗаполнения.ВидПродукции);
			Запрос.УстановитьПараметр("ВеличинаПартии", ДанныеЗаполнения.ПланируемоеКоличество);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			КоличествоЗначащихСтрок = 0;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				КоличествоЗначащихСтрок = КоличествоЗначащихСтрок + 1;
			КонецЦикла;
			
			Если КоличествоЗначащихСтрок > 0 Тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					НоваяСтрокаТЧ = Пробы.Добавить();
					НоваяСтрокаТЧ.НаименованиеПроб = ВыборкаДетальныеЗаписи.Продукция;
					Если Строка(ТипЗнч(ОбщегоНазначенияСервер.ЕстьВозратМасла(ВыборкаДетальныеЗаписи.Продукция))) = "Число" Тогда
						СкладВозвратаМасла = ДанныеЗаполнения.СкладСписанияСырья;
					КонецЕсли;
					ВозвратноеМасло = ОбщегоНазначенияСервер.УзнатьПолуфабрикат(ВыборкаДетальныеЗаписи.Продукция, Дата);
					Если Строка(ТипЗнч(ВозвратноеМасло)) <> "Будево" Тогда
						ВидМасла = ВозвратноеМасло;
					КонецЕсли;
					Если ДанныеЗаполнения.ДляМасла Тогда
						НоваяСтрокаТЧ.ДатаРозлива = ДанныеЗаполнения.ДатаРозлива;
						НоваяСтрокаТЧ.ДатаИзготовления = ДанныеЗаполнения.ДатаИзготовления;
					Иначе
						НоваяСтрокаТЧ.ДатаИзготовления = ДанныеЗаполнения.Дата;
					КонецЕсли;
					НоваяСтрокаТЧ.ВесПробы = ВыборкаДетальныеЗаписи.КоличествоСписания;
					НоваяСтрокаТЧ.ЦельИсследования = ВыборкаДетальныеЗаписи.ПричинаСписания;
					НоваяСтрокаТЧ.НомерПартии = ДанныеЗаполнения.НомерПартии;
					НоваяСтрокаТЧ.ВеличинаПартии = ДанныеЗаполнения.ПланируемоеКоличество;
				КонецЦикла;
			Иначе 
				НоваяСтрокаТЧ = Пробы.Добавить();
				НоваяСтрокаТЧ.НаименованиеПроб = ДанныеЗаполнения.ВидПродукции;
				Если ДанныеЗаполнения.ДляМасла Тогда
					НоваяСтрокаТЧ.ДатаРозлива = ДанныеЗаполнения.ДатаРозлива;
					НоваяСтрокаТЧ.ДатаИзготовления = ДанныеЗаполнения.ДатаИзготовления;
				Иначе
					НоваяСтрокаТЧ.ДатаИзготовления = ДанныеЗаполнения.Дата;
				КонецЕсли;
				НоваяСтрокаТЧ.НомерПартии = ДанныеЗаполнения.НомерПартии;
				НоваяСтрокаТЧ.ВеличинаПартии = ДанныеЗаполнения.ПланируемоеКоличество;
			КонецЕсли;
		КонецЕсли;
	КонецПроцедуры
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
